leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_regdef.h
/** \brief  Channel Event Flag Register, Group */
typedef struct _Ifx_VADC_G_CEFLAG_Bits
{
    unsigned int CEV0:1;                    /**< \brief [0:0] Channel Event for Channel 0 (rwh) */
    unsigned int CEV1:1;                    /**< \brief [1:1] Channel Event for Channel 1 (rwh) */
    unsigned int CEV2:1;                    /**< \brief [2:2] Channel Event for Channel 2 (rwh) */
    unsigned int CEV3:1;                    /**< \brief [3:3] Channel Event for Channel 3 (rwh) */
    unsigned int CEV4:1;                    /**< \brief [4:4] Channel Event for Channel 4 (rwh) */
    unsigned int CEV5:1;                    /**< \brief [5:5] Channel Event for Channel 5 (rwh) */
    unsigned int CEV6:1;                    /**< \brief [6:6] Channel Event for Channel 6 (rwh) */
    unsigned int CEV7:1;                    /**< \brief [7:7] Channel Event for Channel 7 (rwh) */
    unsigned int CEV8:1;                    /**< \brief [8:8] Channel Event for Channel 8 (rwh) */
    unsigned int CEV9:1;                    /**< \brief [9:9] Channel Event for Channel 9 (rwh) */
    unsigned int CEV10:1;                   /**< \brief [10:10] Channel Event for Channel 10 (rwh) */
    unsigned int CEV11:1;                   /**< \brief [11:11] Channel Event for Channel 11 (rwh) */
    unsigned int CEV12:1;                   /**< \brief [12:12] Channel Event for Channel 12 (rwh) */
    unsigned int CEV13:1;                   /**< \brief [13:13] Channel Event for Channel 13 (rwh) */
    unsigned int CEV14:1;                   /**< \brief [14:14] Channel Event for Channel 14 (rwh) */
    unsigned int CEV15:1;                   /**< \brief [15:15] Channel Event for Channel 15 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_VADC_G_CEFLAG_Bits;

/** \brief  Channel Event Node Pointer Register 0, Group */
typedef struct _Ifx_VADC_G_CEVNP0_Bits
{
    unsigned int CEV0NP:4;                  /**< \brief [3:0] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV1NP:4;                  /**< \brief [7:4] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV2NP:4;                  /**< \brief [11:8] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV3NP:4;                  /**< \brief [15:12] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV4NP:4;                  /**< \brief [19:16] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV5NP:4;                  /**< \brief [23:20] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV6NP:4;                  /**< \brief [27:24] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV7NP:4;                  /**< \brief [31:28] Service Request Node Pointer Channel Event i (rw) */
} Ifx_VADC_G_CEVNP0_Bits;

/** \brief  Channel Event Node Pointer Register 1, Group */
typedef struct _Ifx_VADC_G_CEVNP1_Bits
{
    unsigned int CEV8NP:4;                  /**< \brief [3:0] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV9NP:4;                  /**< \brief [7:4] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV10NP:4;                 /**< \brief [11:8] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV11NP:4;                 /**< \brief [15:12] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV12NP:4;                 /**< \brief [19:16] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV13NP:4;                 /**< \brief [23:20] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV14NP:4;                 /**< \brief [27:24] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV15NP:4;                 /**< \brief [31:28] Service Request Node Pointer Channel Event i (rw) */
} Ifx_VADC_G_CEVNP1_Bits;

/** \brief  Channel Assignment Register, Group */
typedef struct _Ifx_VADC_G_CHASS_Bits
{
    unsigned int ASSCH0:1;                  /**< \brief [0:0] Assignment for Channel 0 (rw) */
    unsigned int ASSCH1:1;                  /**< \brief [1:1] Assignment for Channel 1 (rw) */
    unsigned int ASSCH2:1;                  /**< \brief [2:2] Assignment for Channel 2 (rw) */
    unsigned int ASSCH3:1;                  /**< \brief [3:3] Assignment for Channel 3 (rw) */
    unsigned int ASSCH4:1;                  /**< \brief [4:4] Assignment for Channel 4 (rw) */
    unsigned int ASSCH5:1;                  /**< \brief [5:5] Assignment for Channel 5 (rw) */
    unsigned int ASSCH6:1;                  /**< \brief [6:6] Assignment for Channel 6 (rw) */
    unsigned int ASSCH7:1;                  /**< \brief [7:7] Assignment for Channel 7 (rw) */
    unsigned int ASSCH8:1;                  /**< \brief [8:8] Assignment for Channel 8 (rw) */
    unsigned int ASSCH9:1;                  /**< \brief [9:9] Assignment for Channel 9 (rw) */
    unsigned int ASSCH10:1;                 /**< \brief [10:10] Assignment for Channel 10 (rw) */
    unsigned int ASSCH11:1;                 /**< \brief [11:11] Assignment for Channel 11 (rw) */
    unsigned int ASSCH12:1;                 /**< \brief [12:12] Assignment for Channel 12 (rw) */
    unsigned int ASSCH13:1;                 /**< \brief [13:13] Assignment for Channel 13 (rw) */
    unsigned int ASSCH14:1;                 /**< \brief [14:14] Assignment for Channel 14 (rw) */
    unsigned int ASSCH15:1;                 /**< \brief [15:15] Assignment for Channel 15 (rw) */
    unsigned int ASSCH16:1;                 /**< \brief [16:16] Assignment for Channel 16 (rw) */
    unsigned int ASSCH17:1;                 /**< \brief [17:17] Assignment for Channel 17 (rw) */
    unsigned int ASSCH18:1;                 /**< \brief [18:18] Assignment for Channel 18 (rw) */
    unsigned int ASSCH19:1;                 /**< \brief [19:19] Assignment for Channel 19 (rw) */
    unsigned int ASSCH20:1;                 /**< \brief [20:20] Assignment for Channel 20 (rw) */
    unsigned int ASSCH21:1;                 /**< \brief [21:21] Assignment for Channel 21 (rw) */
    unsigned int ASSCH22:1;                 /**< \brief [22:22] Assignment for Channel 22 (rw) */
    unsigned int ASSCH23:1;                 /**< \brief [23:23] Assignment for Channel 23 (rw) */
    unsigned int ASSCH24:1;                 /**< \brief [24:24] Assignment for Channel 24 (rw) */
    unsigned int ASSCH25:1;                 /**< \brief [25:25] Assignment for Channel 25 (rw) */
    unsigned int ASSCH26:1;                 /**< \brief [26:26] Assignment for Channel 26 (rw) */
    unsigned int ASSCH27:1;                 /**< \brief [27:27] Assignment for Channel 27 (rw) */
    unsigned int ASSCH28:1;                 /**< \brief [28:28] Assignment for Channel 28 (rw) */
    unsigned int ASSCH29:1;                 /**< \brief [29:29] Assignment for Channel 29 (rw) */
    unsigned int ASSCH30:1;                 /**< \brief [30:30] Assignment for Channel 30 (rw) */
    unsigned int ASSCH31:1;                 /**< \brief [31:31] Assignment for Channel 31 (rw) */
} Ifx_VADC_G_CHASS_Bits;

/** \brief  Group, Channel Ctrl. Reg. */
typedef struct _Ifx_VADC_G_CHCTR_Bits
{
    unsigned int ICLSEL:2;                  /**< \brief [1:0] Input Class Select (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int BNDSELL:2;                 /**< \brief [5:4] Lower Boundary Select (rw) */
    unsigned int BNDSELU:2;                 /**< \brief [7:6] Upper Boundary Select (rw) */
    unsigned int CHEVMODE:2;                /**< \brief [9:8] Channel Event Mode (rw) */
    unsigned int SYNC:1;                    /**< \brief [10:10] Synchronization Request (rw) */
    unsigned int REFSEL:1;                  /**< \brief [11:11] Reference Input Selection (rw) */
    unsigned int BNDSELX:4;                 /**< \brief [15:12] BoundaryExtension (rw) */
    unsigned int RESREG:4;                  /**< \brief [19:16] Result Register (rw) */
    unsigned int RESTBS:1;                  /**< \brief [20:20] Result Target for Background Source (rw) */
    unsigned int RESPOS:1;                  /**< \brief [21:21] Result Position (rw) */
    unsigned int reserved_22:6;             /**< \brief \internal Reserved */
    unsigned int BWDCH:2;                   /**< \brief [29:28] Broken Wire Detection Channel (rw) */
    unsigned int BWDEN:1;                   /**< \brief [30:30] Broken Wire Detection Enable (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_VADC_G_CHCTR_Bits;

/** \brief  External Multiplexer Control Register, Group x */
typedef struct _Ifx_VADC_G_EMUXCTR_Bits
{
    unsigned int EMUXSET:3;                 /**< \brief [2:0] External Multiplexer Start Selection (rw) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int EMUXACT:3;                 /**< \brief [10:8] External Multiplexer Actual Selection (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int EMUXCH:10;                 /**< \brief [25:16] External Multiplexer Channel Select (rw) */
    unsigned int EMUXMODE:2;                /**< \brief [27:26] External Multiplexer Mode (rw) */
    unsigned int EMXCOD:1;                  /**< \brief [28:28] External Multiplexer Coding Scheme (rw) */
    unsigned int EMXST:1;                   /**< \brief [29:29] External Multiplexer Sample Time Control (rw) */
    unsigned int EMXCSS:1;                  /**< \brief [30:30] External Multiplexer Channel Selection Style (r) */
    unsigned int EMXWC:1;                   /**< \brief [31:31] Write Control for EMUX Configuration (w) */
} Ifx_VADC_G_EMUXCTR_Bits;

/** \brief  Queue 0 Register 0, Group */
typedef struct _Ifx_VADC_G_Q0R0_Bits
{
    unsigned int REQCHNR:5;                 /**< \brief [4:0] Request Channel Number (rh) */
    unsigned int RF:1;                      /**< \brief [5:5] Refill (rh) */
    unsigned int ENSI:1;                    /**< \brief [6:6] Enable Source Interrupt (rh) */
    unsigned int EXTR:1;                    /**< \brief [7:7] External Trigger (rh) */
    unsigned int V:1;                       /**< \brief [8:8] Request Channel Number Valid (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_VADC_G_Q0R0_Bits;

/** \brief  Queue 3 Register 0, Group */
typedef struct _Ifx_VADC_G_Q0R3_Bits
{
    unsigned int REQCHNR:5;                 /**< \brief [4:0] Request Channel Number (rh) */
    unsigned int RF:1;                      /**< \brief [5:5] Refill (rh) */
    unsigned int ENSI:1;                    /**< \brief [6:6] Enable Source Interrupt (rh) */
    unsigned int EXTR:1;                    /**< \brief [7:7] External Trigger (rh) */
    unsigned int V:1;                       /**< \brief [8:8] Request Channel Number Valid (rh) */
    unsigned int PDD:1;                     /**< \brief [9:9] Pull-Down Diagnostics Enable (rh) */
    unsigned int MDPD:1;                    /**< \brief [10:10] Multiplexer Diagnostics Pull-Devices Enable (rh) */
    unsigned int MDPU:1;                    /**< \brief [11:11] Multiplexer Diagnostics Pull-Devices Enable (rh) */
    unsigned int CDEN:1;                    /**< \brief [12:12] Converter Diagnostics Enable (rh) */
    unsigned int CDSEL:2;                   /**< \brief [14:13] Converter Diagnostics Pull-Devices Select (rh) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_VADC_G_Q0R3_Bits;

