leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_VADC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_VADC_KRSTCLR_Bits;

/** \brief  OCDS Control and Status Register */
typedef struct _Ifx_VADC_OCS_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    unsigned int TGB:1;                     /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    unsigned int TG_P:1;                    /**< \brief [3:3] TGS, TGB Write Protection (w) */
    unsigned int reserved_4:20;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_VADC_OCS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Vadc_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_ACCEN0;

/** \brief  Access Protection Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_ACCPROT0_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_ACCPROT0;

/** \brief  Access Protection Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_ACCPROT1_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_ACCPROT1;

/** \brief  Background Request Source Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_BRSCTRL_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_BRSCTRL;

/** \brief  Background Request Source Mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_BRSMR_Bits B;                  /**< \brief Bitfield access */
} Ifx_VADC_BRSMR;

/** \brief  Background Request Source Pending Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_BRSPND_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_BRSPND;

/** \brief  Background Request Source Channel Select Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_BRSSEL_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_BRSSEL;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_VADC_CLC;

/** \brief  External Multiplexer Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_EMUXSEL_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_EMUXSEL;

/** \brief  Alias Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ALIAS_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_ALIAS;

/** \brief  Arbitration Configuration Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ARBCFG_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_ARBCFG;

/** \brief  Arbitration Priority Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ARBPR_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_ARBPR;

/** \brief  Autoscan Source Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ASCTRL_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_ASCTRL;

/** \brief  Autoscan Source Mode Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ASMR_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_ASMR;

/** \brief  Autoscan Source Pending Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ASPND_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_ASPND;

/** \brief  Autoscan Source Channel Select Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_ASSEL_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_ASSEL;

/** \brief  Boundary Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_BFL_Bits B;                  /**< \brief Bitfield access */
} Ifx_VADC_G_BFL;

/** \brief  Boundary Flag Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_BFLC_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_BFLC;

/** \brief  Boundary Flag Node Pointer Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_BFLNP_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_BFLNP;

/** \brief  Boundary Flag Software Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_BFLS_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_BFLS;

