leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_regdef.h
/** \brief  Boundary Select Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_BOUND_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_BOUND;

/** \brief  Channel Event Flag Clear Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_CEFCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_CEFCLR;

/** \brief  Channel Event Flag Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_CEFLAG_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_CEFLAG;

/** \brief  Channel Event Node Pointer Register 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_CEVNP0_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_CEVNP0;

/** \brief  Channel Event Node Pointer Register 1, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_CEVNP1_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_CEVNP1;

/** \brief  Channel Assignment Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_CHASS_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_CHASS;

/** \brief  Group, Channel Ctrl. Reg. */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_CHCTR_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_CHCTR;

/** \brief  External Multiplexer Control Register, Group x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_EMUXCTR_Bits B;              /**< \brief Bitfield access */
} Ifx_VADC_G_EMUXCTR;

/** \brief  Queue 0 Register 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_Q0R0_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_Q0R0;

/** \brief  Queue 3 Register 0, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_Q0R3_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_Q0R3;

/** \brief  Queue 0 Backup Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QBUR0_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_QBUR0;

/** \brief  Queue 3 Backup Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QBUR3_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_QBUR3;

/** \brief  Queue 0 Source Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QCTRL0_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_QCTRL0;

/** \brief  Queue 3 Source Control Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QCTRL3_Bits B;               /**< \brief Bitfield access */
} Ifx_VADC_G_QCTRL3;

/** \brief  Queue 0 Input Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QINR0_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_QINR0;

/** \brief  Queue 3 Input Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QINR3_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_G_QINR3;

/** \brief  Queue 0 Mode Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QMR0_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_QMR0;

/** \brief  Queue 3 Mode Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QMR3_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_QMR3;

/** \brief  Queue 0 Status Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QSR0_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_QSR0;

/** \brief  Queue 3 Status Register, Group */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_QSR3_Bits B;                 /**< \brief Bitfield access */
} Ifx_VADC_G_QSR3;

/** \brief  Group Result Control Reg. */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_G_RCR_Bits B;                  /**< \brief Bitfield access */
} Ifx_VADC_G_RCR;

