leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_VADC_KRSTCLR;

/** \brief  OCDS Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_VADC_OCS_Bits B;                    /**< \brief Bitfield access */
} Ifx_VADC_OCS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Vadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Group objects */
typedef volatile struct _Ifx_VADC_G
{
    Ifx_VADC_G_ARBCFG ARBCFG;               /**< \brief 0, Arbitration Configuration Register, Group  */
    Ifx_VADC_G_ARBPR ARBPR;                 /**< \brief 4, Arbitration Priority Register, Group  */
    Ifx_VADC_G_CHASS CHASS;                 /**< \brief 8, Channel Assignment Register, Group  */
    Ifx_VADC_G_RRASS RRASS;                 /**< \brief C, Result Assignment Register, Group  */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
    Ifx_VADC_ICLASS ICLASS[2];              /**< \brief 20, Input Class Register */
    unsigned char reserved_28[8];           /**< \brief 28, \internal Reserved */
    Ifx_VADC_G_ALIAS ALIAS;                 /**< \brief 30, Alias Register, Group  */
    unsigned char reserved_34[4];           /**< \brief 34, \internal Reserved */
    Ifx_VADC_G_BOUND BOUND;                 /**< \brief 38, Boundary Select Register, Group  */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_VADC_G_SYNCTR SYNCTR;               /**< \brief 40, Synchronization Control Register, Group  */
    unsigned char reserved_44[4];           /**< \brief 44, \internal Reserved */
    Ifx_VADC_G_BFL BFL;                     /**< \brief 48, Boundary Flag Register, Group  */
    Ifx_VADC_G_BFLS BFLS;                   /**< \brief 4C, Boundary Flag Software Register, Group  */
    Ifx_VADC_G_BFLC BFLC;                   /**< \brief 50, Boundary Flag Control Register, Group  */
    Ifx_VADC_G_BFLNP BFLNP;                 /**< \brief 54, Boundary Flag Node Pointer Register, Group  */
    unsigned char reserved_58[40];          /**< \brief 58, \internal Reserved */
    Ifx_VADC_G_QCTRL0 QCTRL0;               /**< \brief 80, Queue 0 Source Control Register, Group  */
    Ifx_VADC_G_QMR0 QMR0;                   /**< \brief 84, Queue 0 Mode Register, Group  */
    Ifx_VADC_G_QSR0 QSR0;                   /**< \brief 88, Queue 0 Status Register, Group  */
    Ifx_VADC_G_Q0R0 Q0R0;                   /**< \brief 8C, Queue 0 Register 0, Group  */
    union
    {
        Ifx_VADC_G_QBUR0 QBUR0;             /**< \brief 90, Queue 0 Input Register, Group  */
        Ifx_VADC_G_QINR0 QINR0;             /**< \brief 90, Queue 0 Input Register, Group  */
    };

    unsigned char reserved_94[12];          /**< \brief 94, \internal Reserved */
    Ifx_VADC_G_ASCTRL ASCTRL;               /**< \brief A0, Autoscan Source Control Register, Group  */
    Ifx_VADC_G_ASMR ASMR;                   /**< \brief A4, Autoscan Source Mode Register, Group  */
    Ifx_VADC_G_ASSEL ASSEL;                 /**< \brief A8, Autoscan Source Channel Select Register, Group  */
    Ifx_VADC_G_ASPND ASPND;                 /**< \brief AC, Autoscan Source Pending Register, Group  */
    unsigned char reserved_B0[16];          /**< \brief B0, \internal Reserved */
    Ifx_VADC_G_QCTRL3 QCTRL3;               /**< \brief C0, Queue 3 Source Control Register, Group  */
    Ifx_VADC_G_QMR3 QMR3;                   /**< \brief C4, Queue 3 Mode Register, Group  */
    Ifx_VADC_G_QSR3 QSR3;                   /**< \brief C8, Queue 3 Status Register, Group  */
    Ifx_VADC_G_Q0R3 Q0R3;                   /**< \brief CC, Queue 3 Register 0, Group  */
    union
    {
        Ifx_VADC_G_QBUR3 QBUR3;             /**< \brief D0, Queue 3 Input Register, Group  */
        Ifx_VADC_G_QINR3 QINR3;             /**< \brief D0, Queue 3 Input Register, Group  */
    };

    Ifx_VADC_G_TRCTR TRCTR;                 /**< \brief D4, Trigger Control Register, Group  */
    unsigned char reserved_D8[40];          /**< \brief D8, \internal Reserved */
    Ifx_VADC_G_CEFLAG CEFLAG;               /**< \brief 100, Channel Event Flag Register, Group  */
    Ifx_VADC_G_REFLAG REFLAG;               /**< \brief 104, Result Event Flag Register, Group  */
    Ifx_VADC_G_SEFLAG SEFLAG;               /**< \brief 108, Source Event Flag Register, Group  */
    unsigned char reserved_10C[4];          /**< \brief 10C, \internal Reserved */
    Ifx_VADC_G_CEFCLR CEFCLR;               /**< \brief 110, Channel Event Flag Clear Register, Group  */
    Ifx_VADC_G_REFCLR REFCLR;               /**< \brief 114, Result Event Flag Clear Register, Group  */
    Ifx_VADC_G_SEFCLR SEFCLR;               /**< \brief 118, Source Event Flag Clear Register, Group  */
    unsigned char reserved_11C[4];          /**< \brief 11C, \internal Reserved */
    Ifx_VADC_G_CEVNP0 CEVNP0;               /**< \brief 120, Channel Event Node Pointer Register 0, Group  */
    Ifx_VADC_G_CEVNP1 CEVNP1;               /**< \brief 124, Channel Event Node Pointer Register 1, Group  */
    unsigned char reserved_128[8];          /**< \brief 128, \internal Reserved */
    Ifx_VADC_G_REVNP0 REVNP0;               /**< \brief 130, Result Event Node Pointer Register 0, Group  */
    Ifx_VADC_G_REVNP1 REVNP1;               /**< \brief 134, Result Event Node Pointer Register 1, Group  */
    unsigned char reserved_138[8];          /**< \brief 138, \internal Reserved */
    Ifx_VADC_G_SEVNP SEVNP;                 /**< \brief 140, Source Event Node Pointer Register, Group  */
    unsigned char reserved_144[4];          /**< \brief 144, \internal Reserved */
    Ifx_VADC_G_SRACT SRACT;                 /**< \brief 148, Service Request Software Activation Trigger, Group  */
    unsigned char reserved_14C[36];         /**< \brief 14C, \internal Reserved */
    Ifx_VADC_G_EMUXCTR EMUXCTR;             /**< \brief 170, External Multiplexer Control Register, Group x */
    unsigned char reserved_174[4];          /**< \brief 174, \internal Reserved */
    Ifx_VADC_G_VFR VFR;                     /**< \brief 178, Valid Flag Register, Group  */
    unsigned char reserved_17C[4];          /**< \brief 17C, \internal Reserved */
    Ifx_VADC_G_CHCTR CHCTR[12];             /**< \brief 180, Group, Channel Ctrl. Reg. */
    unsigned char reserved_1B0[80];         /**< \brief 1B0, \internal Reserved */
    Ifx_VADC_G_RCR RCR[16];                 /**< \brief 200, Group Result Control Reg. */
    unsigned char reserved_240[64];         /**< \brief 240, \internal Reserved */
    Ifx_VADC_G_RES RES[16];                 /**< \brief 280, Group Result Register */
    unsigned char reserved_2C0[64];         /**< \brief 2C0, \internal Reserved */
    Ifx_VADC_G_RESD RESD[16];               /**< \brief 300, Group Result Reg., Debug */
    unsigned char reserved_340[192];        /**< \brief 340, \internal Reserved */
} Ifx_VADC_G;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Vadc_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  VADC object */
typedef volatile struct _Ifx_VADC
{
    Ifx_VADC_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_VADC_ID ID;                         /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[28];           /**< \brief C, \internal Reserved */
    Ifx_VADC_OCS OCS;                       /**< \brief 28, OCDS Control and Status Register */
    Ifx_VADC_KRSTCLR KRSTCLR;               /**< \brief 2C, Kernel Reset Status Clear Register */
    Ifx_VADC_KRST1 KRST1;                   /**< \brief 30, Kernel Reset Register 1 */
    Ifx_VADC_KRST0 KRST0;                   /**< \brief 34, Kernel Reset Register 0 */
    unsigned char reserved_38[4];           /**< \brief 38, \internal Reserved */
    Ifx_VADC_ACCEN0 ACCEN0;                 /**< \brief 3C, Access Enable Register 0 */
    unsigned char reserved_40[64];          /**< \brief 40, \internal Reserved */
    Ifx_VADC_GLOBCFG GLOBCFG;               /**< \brief 80, Global Configuration Register */
    unsigned char reserved_84[4];           /**< \brief 84, \internal Reserved */
    Ifx_VADC_ACCPROT0 ACCPROT0;             /**< \brief 88, Access Protection Register */
    Ifx_VADC_ACCPROT1 ACCPROT1;             /**< \brief 8C, Access Protection Register */
    unsigned char reserved_90[16];          /**< \brief 90, \internal Reserved */
    Ifx_VADC_ICLASS GLOBICLASS[2];          /**< \brief A0, Input Class Register */
    unsigned char reserved_A8[16];          /**< \brief A8, \internal Reserved */
    Ifx_VADC_GLOBBOUND GLOBBOUND;           /**< \brief B8, Global Boundary Select Register */
    unsigned char reserved_BC[36];          /**< \brief BC, \internal Reserved */
    Ifx_VADC_GLOBEFLAG GLOBEFLAG;           /**< \brief E0, Global Event Flag Register */
    unsigned char reserved_E4[92];          /**< \brief E4, \internal Reserved */
    Ifx_VADC_GLOBEVNP GLOBEVNP;             /**< \brief 140, Global Event Node Pointer Register */
    unsigned char reserved_144[28];         /**< \brief 144, \internal Reserved */
    Ifx_VADC_GLOBTF GLOBTF;                 /**< \brief 160, Global Test Functions Register */
    Ifx_VADC_GLOBTE GLOBTE;                 /**< \brief 164, Global Test Enable Register */
    unsigned char reserved_168[24];         /**< \brief 168, \internal Reserved */
    Ifx_VADC_BRSSEL BRSSEL[4];              /**< \brief 180, Background Request Source Channel Select Register, Group */
    unsigned char reserved_190[48];         /**< \brief 190, \internal Reserved */
    Ifx_VADC_BRSPND BRSPND[4];              /**< \brief 1C0, Background Request Source Pending Register, Group */
    unsigned char reserved_1D0[48];         /**< \brief 1D0, \internal Reserved */
    Ifx_VADC_BRSCTRL BRSCTRL;               /**< \brief 200, Background Request Source Control Register */
    Ifx_VADC_BRSMR BRSMR;                   /**< \brief 204, Background Request Source Mode Register */
    unsigned char reserved_208[120];        /**< \brief 208, \internal Reserved */
    Ifx_VADC_GLOBRCR GLOBRCR;               /**< \brief 280, Global Result Control Register */
    unsigned char reserved_284[124];        /**< \brief 284, \internal Reserved */
    Ifx_VADC_GLOBRES GLOBRES;               /**< \brief 300, Global Result Register */
    unsigned char reserved_304[124];        /**< \brief 304, \internal Reserved */
    Ifx_VADC_GLOBRESD GLOBRESD;             /**< \brief 380, Global Result Register, Debug */
    unsigned char reserved_384[108];        /**< \brief 384, \internal Reserved */
    Ifx_VADC_EMUXSEL EMUXSEL;               /**< \brief 3F0, External Multiplexer Select Register */
    unsigned char reserved_3F4[140];        /**< \brief 3F4, \internal Reserved */
    Ifx_VADC_G G[4];                        /**< \brief 480, Group objects */
    unsigned char reserved_1480[11136];     /**< \brief 1480, \internal Reserved */
} Ifx_VADC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#if defined (__TASKING__)
#pragma warning restore
#endif
/******************************************************************************/
#endif /* IFXVADC_REGDEF_H */
